nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/freemaster_examples/fmstr_any/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC0 (number 3), J502[8]/J500A[B24]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), J502[10]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), J502[15]/J16[1]/J500A[B42]/CANTX
  @{ */
#define BOARD_CANTX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CANTX_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_CANTX_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOC12 (number 38), J502[17]/J16[3]/J500A[B41]/CANRX
  @{ */
#define BOARD_CANRX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CANRX_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_CANRX_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
